app/controllers/chatroom_controller.rb

  def index
    @message = Message.new
    @messages = Message.includes(:user).last_20_messages
---
SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC LIMIT ?  [["LIMIT", 20]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]