app/controllers/messages_controller.rb

  def create
    message = current_user.messages.build(message_params)
    if message.save
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "first message from input"], ["user_id", 2], ["created_at", "2019-09-01 16:42:29.840250"], ["updated_at", "2019-09-01 16:42:29.840250"]]