app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "datnt"], ["LIMIT", 1]]
---
  def user_from_form
    @user = User.find_by(username: params[:user][:username].downcase)