app/models/message.rb

  scope :last_20_messages, -> { order(:created_at).last(20) }
---
SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC LIMIT ?  [["LIMIT", 20]]